/**
 * ============================================================
 * 📘 Object Property Shortcuts
 * ============================================================
 */

const name = "Hasib";
const age = 25;
const role = 5;

/**
 * ============================================================
 * 🧩 Old Way
 * ============================================================
 */

const user1 = {
  name: name,
  age: age,
  class: role,
};

console.log(user1);

/**
 * ============================================================
 * 🧩 Modern Shortcut
 * ============================================================
 * If variable name and object key are similar then you should use shortcut or modern way
 */

const user2 = {
  name,
  age,
  role,
};

console.log(user2);

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * Same variable name হলে shortcut ব্যবহার করা যায়
 *
 * ============================================================
 */
