/**
 * ============================================================
 * 📘 Object.freeze() & Object.seal()
 * ============================================================
 */

const user = {
  name: "Hasib",
};

/**
 * ============================================================
 * 🧩 Object.freeze()
 * ============================================================
 *
 * কোনো modification allowed না
 */

Object.freeze(user);

user.name = "Rakib";
user.age = 25;

console.log(user);

/**
 * ============================================================
 * 🧩 Object.seal()
 * ============================================================
 *
 * Update করা যাবে
 * কিন্তু add/delete করা যাবে না
 */

const product = {
  name: "Laptop",
};

// Object.seal(product);

product.name = "Desktop";
product.quantity = 25;

delete product.name;

console.log(product);

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * freeze:
 * → fully locked
 *
 * seal:
 * → partially locked
 *
 * ============================================================
 */
