/**
 * ============================================================
 * 📘 Early Return Pattern
 * ============================================================
 *
 * function এর শুরুতেই condition check করে return করা
 */

/**
 * ============================================================
 * 🧩 Example
 * ============================================================
 */

function login(user) {
  if (!user) return "No user found";

  if (!user.isVerified) return "User not verified";

  return "Login successful";
}

let user = {
  isVerified: true,
};

console.log(login(user));

/**
 * ============================================================
 * 🧠 WHY USE IT?
 * ============================================================
 *
 * → reduce nested code
 * → readable logic
 */

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * early return → clean code pattern
 *
 * ============================================================
 */
