/**
 * ============================================================
 * 📘 Focus & Blur Events
 * ============================================================
 */

const input = document.getElementById("username");

/**
 * ============================================================
 * 🧩 focus
 * ============================================================
 */

input.addEventListener("focus", function () {
  console.log(this);

  this.style.outline = "2px solid blue";
  this.style.borderRadius = "5px";
});

/**
 * ============================================================
 * 🧩 blur
 * ============================================================
 */

input.addEventListener("blur", function () {
  console.log("Input Lost Focus");
  this.style.outline = "2px solid red";
});

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * Input focus state detect করা যায়
 *
 * ============================================================
 */
