/**
 * ============================================================
 * 📘 Form Submit Event
 * ============================================================
 */

const form = document.getElementById("form");

/**
 * ============================================================
 * 🧩 submit event
 * ============================================================
 */

form.addEventListener("submit", function (event) {
  event.preventDefault();

  const username = document.getElementById("username").value;

  console.log("Form Submitted", username);
});

/**
 * ============================================================
 * ⚠️ IMPORTANT
 * ============================================================
 *
 * preventDefault():
 * → page reload stop করে
 */

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * Form submit control করা যায়
 *
 * ============================================================
 */
