/**
 * ============================================================
 * 📘 Event Bubbling
 * ============================================================
 */

/**
 * ============================================================
 * 🧩 Bubbling Flow
 * ============================================================
 *
 * Child → Parent
 */

document.querySelector(".container").addEventListener("click", function () {
  console.log("Container");
});

document.getElementById("btn").addEventListener("click", function () {
  console.log("Button");
});

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * Event bubbling:
 * → নিচ থেকে উপরে যায়
 *
 * ============================================================
 */
