/**
 * ============================================================
 * 📘 IIFE
 * Immediately Invoked Function Expression
 * ============================================================
 *
 * Define করার সাথে সাথে execute হয়
 */

/**
 * ============================================================
 * 🧩 Example
 * ============================================================
 */

(function () {
  console.log("IIFE Executed");
})();

(() => {
  console.log("Boiler plate of Immediately Invoked Function.");
})();
/**
 * () -> to diclear a function
 * () => last is used for Expression
 */

/**
 * ============================================================
 * 🧠 WHY USED?
 * ============================================================
 *
 * → private scope তৈরি করতে
 * → variable conflict avoid করতে
 */

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * IIFE:
 * → instant execution function
 *
 * ============================================================
 */
