/**
 * ============================================================
 * 📘 filter()
 * ============================================================
 *
 * Condition অনুযায়ী data filter করে
 */

const numbers = [10, 15, 20, 25];

/**
 * ============================================================
 * 🧩 Example
 * ============================================================
 */

const result = numbers.filter((num) => {
  return num >= 20;
});

/**
 * Check the condition, if it return true
 * then returns the value in result variable make an array
 */

console.log(result);

/**
 * ============================================================
 * 🎯 SUMMARY
 * ============================================================
 *
 * filter:
 * → matching data return করে
 *
 * ============================================================
 */
